In [1]:
# dataframes is a datastr. used in pandas
# it has two indices (row ans col)
# it has a tabular structure with rows and columns

# creating a dataframe :
# first we create a dictionary then make dataframe of it

data = {'name': ['john', 'tim', 'rob'], 
        'age': [19, 20, 21],
        'salary': [1000, 2000, 3000]
       }

In [2]:
# to convert this data into dataframe :

from pandas import DataFrame

# creating frame object
frame = DataFrame(data)

In [3]:
frame         # displaying dataframe.

   name  age  salary
0  john   19    1000
1   tim   20    2000
2   rob   21    3000

In [7]:
# changing column sequence in DataFrame:

new_frame = DataFrame(data, columns=['name', 'salary', 'age', 'address'])

In [8]:
new_frame

   name  salary  age address
0  john    1000   19     NaN
1   tim    2000   20     NaN
2   rob    3000   21     NaN

In [9]:
# how to retrieve data from dataframe in form of series :

new_frame['salary']

0    1000
1    2000
2    3000
Name: salary, dtype: int64

In [11]:
# to retrieve a row using it's index:

new_frame.iloc[2]

name        rob
salary     3000
age          21
address     NaN
Name: 2, dtype: object

In [12]:
# modifying a dataframe :
# assigning values to an attribute

new_frame['address'] = 'jabalpur'
# above will change the address field of all rows as jabalour

In [13]:
new_frame

   name  salary  age   address
0  john    1000   19  jabalpur
1   tim    2000   20  jabalpur
2   rob    3000   21  jabalpur

In [16]:
 # to add a particular field in a dataframe :

new_frame['degree'] = 'Btech'

In [23]:
new_frame

   name  salary  age   address degree
0  john    1000   19  jabalpur  Btech
1   tim    2000   20  jabalpur  Btech
2   rob    3000   21  jabalpur  Btech

In [22]:
# how to transpose the dataframe :

new_frame.T

                0         1         2
name         john       tim       rob
salary       1000      2000      3000
age            19        20        21
address  jabalpur  jabalpur  jabalpur
degree      Btech     Btech     Btech